class Question {
  final int id, answer;
  final String question;
  final List<String> options;

  Question({required this.id, required this.question, required this.answer, required this.options});
}

const List em_question = [
  {"id":0,"question":"คลื่นแม่เหล็กไฟฟ้าที่สามารถสะท้อนในบรรยากาศชั้นไอโอโนสเฟียร์ได้ และมักถูกนำมาใช้ประโยชน์ด้านการสื่อสาร คือข้อใด ","options":["คลื่นไมโครเวฟ","รังสีแกมมา","รังสีเอ็กซ์","คลื่นวิทยุ"],"answer_index":0,},
  {"id":1,"question":"ข้อใดเป็นคลื่นแม่เหล็กไฟฟ้าที่มีความยาวคลื่นมากที่สุด ","options":["คลื่นวิทยุ","รังสีอินฟราเรด","รังสีแกมมา","คลื่นโทรทัศน์"],"answer_index":0,},
  {"id":2,"question":"ข้อใดเป็นคลื่นแม่เหล็กไฟฟ้าที่สามารถสะท้อนผิวโลหะได้ดี","options":["คลื่นวิทยุ","คลื่นไมโครเวฟ","รังสีแกมมา","รังสีอินฟราเรด"],"answer_index":1,},
  {"id":3,"question":"สิ่งมีชีวิตส่วนใหญ่จะแผ่คลื่นแม่เหล็กไฟฟ้าชนิดนี้ออกมา คลื่นแม่เหล็กไฟฟ้าชนิดนี้ คือข้อใด","options":["รังสีอินฟราเรด","รังสีอัลตราไวโอเลต","รังสีเอ็กซ์","คลื่นไมโครเวฟ"],"answer_index":0,},
  {"id":4,"question":"ข้อใดเป็นคลื่นแม่เหล็กไฟฟ้าที่มีความยาวคลื่นอยู่ในช่วง 400 – 700 นาโนเมตร และตาของมนุษย์สามารถมองเห็นได้","options":["คลื่นไมโครเวฟ","คลื่นแสง","คลื่นวิทยุ","คลื่นโทรทัศน์"],"answer_index":1,},
  {"id":5,"question":"คลื่นแม่เหล็กไฟฟ้าชนิดใดสามารถทำให้เกิดประจุอิสระ และไอออนในบรรยากาศชั้นไอโอโนสเฟียร์ได้","options":["รังสีแกมมา","รังสีอัลตราไวโอเลต","รังสีเอ็กซ์","คลื่นวิทยุ"],"answer_index":1,},
  {"id":6,"question":"คลื่นแม่เหล็กไฟฟ้าชนิดใดจะไม่เกิดการเบี่ยงเบนเมื่อเข้าสู่สนามแม่เหล็กและสนามไฟฟ้า","options":["รังสีอัลตราไวโอเลต","รังสีเอ็กซ์","รังสีแกมมา","รังสีอัลตราไวโอเลต และรังสีเอ็กซ์"],"answer_index":3,},
  {"id":7,"question":"คลื่นแม่เหล็กไฟฟ้าชนิดใดสามารถทำให้โมเลกุลของน้ำสั่นจนสามารถทำให้เกิดความร้อนได้ ","options":["คลื่นไมโครเวฟ","รังสีแกมมา","รังสีเอ็กซ์","คลื่นวิทยุ"],"answer_index":0,},
  {"id":8,"question":"ข้อใดเป็นการเรียงลำดับคลื่นแม่เหล็กไฟฟ้าจากความยาวคลื่นน้อยไปมากได้ถูกต้อง ","options":["รังสีเอ็กซ์ อินฟราเรด ไมโครเวฟ","อินฟราเรด ไมโครเวฟ รังสีเอ็กซ์","รังสีเอ็กซ์ ไมโครเวฟ อินฟราเรด","ไมโครเวฟ อินฟราเรด รังสีเอ็กซ์"],"answer_index":0,},
  {"id":9,"question":"คลื่นแม่เหล็กไฟฟ้าชนิดใดมีความถี่และพลังงานมากที่สุด ","options":["รังสีแกมมา","รังสีเอ็กซ์","รังสีอัลตราไวโอเลต","คลื่นไมโครเวฟ"],"answer_index":0,},
  {"id":10,"question":"ข้อใดเป็นการเรียงลำดับคลื่นแม่เหล็กไฟฟ้าจากความถี่น้อยไปมากได้ถูกต้อง ","options":["รังสีแกมมา อินฟราเรด คลื่นวิทยุ","อินฟราเรด คลื่นวิทยุ รังสีแกมมา","คลื่นวิทยุ อินฟราเรด รังสีแกมมา","รังสีแกมมา คลื่นวิทยุ อินฟราเรด"],"answer_index":2,},
  {"id":11,"question":"ข้อใดเป็นการเรียงลำดับคลื่นแม่เหล็กไฟฟ้าจากพลังงานน้อยไปมากได้ถูกต้อง ","options":["คลื่นวิทยุ อินฟราเรด รังสีแกมมา","รังสีแกมมา อินฟราเรด คลื่นวิทยุ","คลื่นวิทยุ รังสีแกมมา อินฟราเรด","อินฟราเรด คลื่นวิทยุ รังสีแกมมา"],"answer_index":0,},
  {"id":12,"question":"มนุษย์อวกาศ 2 คน ปฏิบัติการภารกิจบนพื้นผิวดวงจันทร์ สื่อสารด้วยวิธีการใดสะดวกที่สุด ","options":["คลื่นเสียงธรรมดา","คลื่นเสียงอัลตราซาวด์","คลื่นวิทยุ","คลื่นโซนาร์"],"answer_index":2,},
  {"id":13,"question":"สมบัติข้อใดของคลื่นไมโครเวฟที่ทำให้อาหารสุกได้ ","options":["ทะลุผ่านวัตถุได้ดี","มีความถี่สูงกว่าคลื่นวิทยุ","ทำให้โมเลกุลของน้ำสั่น","เมื่อผ่านวัตถุจะสะท้อนไปมาในวัตถุได้"],"answer_index":2,},
  {"id":14,"question":"การที่เราอยู่กลางแดดนาน ๆ แล้วผิวหนังไหม้ เนื่องมาจากผลของรังสีใด ","options":["รังสีอินฟราเรด","รังสีอัลตราไวโอเลต","รังสีเอ็กซ์","รังสีแกมมา"],"answer_index":1,},
  {"id":15,"question":"คลื่นแม่เหล็กไฟฟ้าที่นิยมนำมาใช้ในรีโมทคอนโทรลคือข้อใด ","options":["อินฟราเรด","ไมโครเวฟ","คลื่นวิทยุ","อัลตราไวโอเลต"],"answer_index":0,},
  {"id":16,"question":"ข้อใดไม่ใช่คุณสมบัติของวิทยุระบบ AM","options":["สื่อสารทางไกลได้ดีกว่าระบบ FM","ถูกรบกวนได้ง่ายกว่า AM","สะท้อนได้ดีในชั้นไอโอนาเฟียร์","ความถี่เปลี่ยนตามสัญญาณเสียง"],"answer_index":3,},
  {"id":17,"question":"ข้อใดคือคุณสมบัติของวิทยุระบบ FM ","options":["ให้แอมพลิจูดเปลี่ยนแต่ความถี่คงที่","สะท้อนได้น้อยในชั้นไอโอโนสเฟียร์","สื่อสารทางไกลได้ดี","ถูกคลื่นรบกวนได้น้อย"],"answer_index":1,},
  {"id":18,"question":"สเปกตรัมของคลื่นแม่เหล็กไฟฟ้าที่เป็นอันตรายต่อร่างกายเป็นอย่างมาก คือข้อใด ","options":["แสง","อินฟราเรด","ไมโครเวฟ","รังสีแกมมา"],"answer_index":3,},
  {"id":19,"question":"คลื่นแม่เหล็กไฟฟ้าชนิดใดต่อไปนี้ มีความสามารถในการทะลุทะลวงสูงที่สุด","options":["อินฟราเรด","รังสีแกมมา","ไมโครเวฟ","อัลตราไวโอเลต"],"answer_index":1,},
];